.sample-xml/account-balance-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:fcub="http://fcubs.ofss.com/service/FCUBSAccService">
   <soapenv:Header/>
   <soapenv:Body>
      <fcub:QUERYACCTBAL_IOFS_REQ>
         <fcub:FCUBS_HEADER>
            <fcub:SOURCE>SMFBPORTAL</fcub:SOURCE>
            <fcub:UBSCOMP>FCUBS</fcub:UBSCOMP>
            <fcub:USERID>SYSTEM</fcub:USERID>
            <fcub:BRANCH>001</fcub:BRANCH>
            <fcub:SERVICE>FCUBSAccService</fcub:SERVICE>
            <fcub:OPERATION>QueryAcctBal</fcub:OPERATION>
         </fcub:FCUBS_HEADER>
         <fcub:FCUBS_BODY>
            <fcub:Custbal-IO>
               <fcub:CUST_AC_NO>0010172338</fcub:CUST_AC_NO>
               <fcub:BRHCODE>001</fcub:BRHCODE>
            </fcub:Custbal-IO>
         </fcub:FCUBS_BODY>
      </fcub:QUERYACCTBAL_IOFS_REQ>
   </soapenv:Body>
</soapenv:Envelope>